In [1]:
import pandas as pd

In [6]:
a = pd.read_csv('../../csv/csv_exam.csv',index_col='id')

In [7]:
a

    class  math  english  science
id
1       1    50       98       50
2       1    60       97       60
3       1    45       86       78
4       1    30       98       58
5       2    25       80       65
6       2    50       89       98
7       2    80       90       45
8       2    90       78       25
9       3    20       98       15
10      3    50       98       45
11      3    65       65       65
12      3    45       85       32
13      4    46       98       65
14      4    48       87       12
15      4    75       56       78
16      4    58       98       65
17      5    65       68       98
18      5    80       78       90
19      5    89       68       87
20      5    78       83       58

In [9]:
a.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 1 to 20
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   class    20 non-null     int64
 1   math     20 non-null     int64
 2   english  20 non-null     int64
 3   science  20 non-null     int64
dtypes: int64(4)
memory usage: 800.0 bytes

In [14]:
a['math'].mean()

57.45

In [15]:
a.isna().any()

class      False
math       False
english    False
science    False
dtype: bool

In [16]:
a.describe()

           class       math    english    science
count  20.000000  20.000000  20.000000  20.000000
mean    3.000000  57.450000  84.900000  59.450000
std     1.450953  20.299015  12.875517  25.292968
min     1.000000  20.000000  56.000000  12.000000
25%     2.000000  45.750000  78.000000  45.000000
50%     3.000000  54.000000  86.500000  62.500000
75%     4.000000  75.750000  98.000000  78.000000
max     5.000000  90.000000  98.000000  98.000000

In [17]:
a.groupby(['class'])

In [29]:
a.groupby(['class']).get_group(1)

C:\Users\Jws\AppData\Local\Temp\ipykernel_12656\2619504755.py:1: FutureWarning: When grouping with a length-1 list-like, you will need to pass a length-1 tuple to get_group in a future version of pandas. Pass `(name,)` instead of `name` to silence this warning.
  a.groupby(['class']).get_group(1)

    class  math  english  science
id
1       1    50       98       50
2       1    60       97       60
3       1    45       86       78
4       1    30       98       58